Repository: NMarjou/localization-app
Catalog: TMs/en-US_th-TH.tmx
Source language: en_us
Languages: th_th

source: Move {{count}} review to the "In progress" stage. Managers will need to submit their review again. This action cannot be undone.
th_th: ย้ายแบบประเมิน {{count}} รายการไปยังขั้นตอน "กำลังดำเนินการ" ผู้จัดการจะต้องส่งแบบประเมินของตนอีกครั้ง การดำเนินการนี้ไม่สามารถย้อนกลับได้

source: Move {{count}} reviews to the "In progress" stage. Managers will need to submit their review again. This action cannot be undone.
th_th: ย้ายรีวิว {{count}} รายการไปยังขั้นตอน "กำลังดำเนินการ" ผู้จัดการจะต้องส่งรีวิวของตนอีกครั้ง การดำเนินการนี้ไม่สามารถย้อนกลับได้

source: Reopen reviews
th_th: เปิดการประเมินอีกครั้ง

source: This review is now reopened for managers to edit. The reviews will need to be republished to capture the changes/updates of the managers. If you have reopened a significant number of reviews, please allow adequate processing time for the completion of this action. You can still keep using the application and take any further actions required while the system is processing.
th_th: ขณะนี้ การประเมินผลงานนี้เปิดให้หัวหน้างานแก้ไขอีกครั้งแล้ว การประเมินผลงานจะต้องได้รับการเผยแพร่ซ้ำเพื่อบันทึกการเปลี่ยนแปลง/การอัปเดตของหัวหน้างาน หากคุณได้เปิดการประเมินผลงานจำนวนมากอีกครั้ง โปรดให้เวลาในการประมวลผลเพียงพอสำหรับการดำเนินการนี้ให้เสร็จสิ้น คุณยังคงใช้แอปพลิเคชันต่อไปได้ และดำเนินการใดๆ เพิ่มเติมที่จำเป็นได้ในขณะที่ระบบกำลังดำเนินการอยู่

source: {{count}} review was successfully moved to the "Conversation & publication" stage.
th_th: การประเมินผลงาน {{count}} รายการได้ถูกย้ายไปยังขั้นตอน "การสนทนาและการเผยแพร่" สำเร็จแล้ว

source: {{count}} reviews were successfully moved to the "Conversation & publication" stage.
th_th: การประเมินผลงาน {{count}} รายการถูกย้ายไปยังขั้นตอน "การสนทนาและการเผยแพร่" สำเร็จแล้ว

source: Moving a closed review back to the "Conversation & publication" stage allows the manager to edit the review and publish again.
th_th: การย้ายการประเมินผลงานที่ปิดแล้วกลับไปยังขั้นตอน "การสนทนาและการเผยแพร่" จะทำให้หัวหน้างานสามารถแก้ไขการประเมินผลงานและเผยแพร่ได้อีกครั้ง

source: Move reviews to "Conversation & publication" stage
th_th: ย้ายการประเมินผลงานไปยังขั้นตอน “การสนทนาและการเผยแพร่”

source: If you have moved a significant number of reviews to this stage, please allow adequate processing time for the completion of this action. You can still keep using the application and take any further actions required while the system is processing.
th_th: หากคุณได้ย้ายการประเมินผลงานจำนวนมากไปยังขั้นตอนนี้ โปรดเผื่อเวลาในการดำเนินการให้เพียงพอสำหรับการดำเนินการนี้ให้เสร็จสิ้น คุณยังคงสามารถใช้แอปพลิเคชันต่อไปได้และดำเนินการใดๆ เพิ่มเติมที่จำเป็นได้ในขณะที่ระบบกำลังดำเนินการอยู่

source: {{count}} review was successfully moved to "Pending sign-off" stage.
th_th: การประเมินผลงาน {{count}} รายการได้ถูกย้ายไปยังขั้นตอน "รอการลงชื่อ" สำเร็จแล้ว

source: {{count}} reviews were successfully moved to "Pending sign-off" stage.
th_th: การประเมินผลงาน {{count}} รายการได้ถูกย้ายไปยังขั้นตอน "รอการลงชื่อ" สำเร็จแล้ว

source: Moving the accepted review back to "Pending sign-off" stage...
th_th: การย้ายการประเมินผลงานที่ได้รับการยอมรับกลับไปสู่ขั้นตอน "รอการลงชื่อ"...

source: Move reviews back to "Pending sign-off" stage
th_th: ย้ายการประเมินผลงานกลับไปที่ขั้นตอน "รอการลงชื่อ"

source: Once a review is closed, it is finalized and no longer editable by either the manager or the worker. However, both parties can still view the content and download the review as a PDF for reference. Note that reviews are processed in the background. Depending on the number of selected reviews, you might still see some forms temporarily in other stages they are being processed. You may continue using the application and perform other actions while the updates are applied.
th_th: เมื่อการประเมินผลถูกปิดแล้ว จะถือว่าเสร็จสมบูรณ์และไม่สามารถแก้ไขได้อีกทั้งโดยผู้จัดการหรือพนักงาน อย่างไรก็ตาม ทั้งสองฝ่ายยังสามารถดูเนื้อหาและดาวน์โหลดการประเมินผลเป็นไฟล์ PDF เพื่อใช้อ้างอิงได้ โปรดทราบว่าการประเมินผลจะถูกประมวลผลในเบื้องหลัง ขึ้นอยู่กับจำนวนการประเมินผลที่เลือก ท่านอาจยังเห็นบางแบบฟอร์มอยู่ในขั้นตอนอื่นชั่วคราวในขณะที่กำลังประมวลผล ท่านสามารถใช้งานแอปพลิเคชันและดำเนินการอื่น ๆ ได้ต่อไปในขณะที่มีการอัปเดตข้อมูล

source: {{count}} review was successfully moved to the "Closed (system)" stage.
th_th: {{count}} รีวิวถูกย้ายไปยังขั้นตอน "ปิด (ระบบ)" เรียบร้อยแล้ว

source: {{count}} reviews were successfully moved to the "Closed (system)" stage.
th_th: {{count}} รีวิวถูกย้ายไปยังขั้นตอน "ปิด (ระบบ)" เรียบร้อยแล้ว

source: Move {{count}} review to the "Closed (system)" stage. This action cannot be undone.
th_th: ย้ายรีวิว {{count}} รายการไปยังขั้นตอน "ปิด (ระบบ)" การดำเนินการนี้ไม่สามารถยกเลิกได้

source: Move {{count}} reviews to the "Closed (system)" stage. This action cannot be undone.
th_th: ย้ายรีวิว {{count}} รายการไปยังขั้นตอน "ปิด (ระบบ)" การดำเนินการนี้ไม่สามารถย้อนกลับได้

source: Once this stage is completed, the manager reviewer will be notified so that they can make changes to their ratings and comments before publishing the review for the worker. Note that forms are processed in the background. Depending on the volume of reviews you have selected, you might still see some of these forms when applying future selections as we process them and send them back to the managers. You can still keep using the application and take any other required actions.
th_th: เมื่อขั้นตอนนี้เสร็จสิ้นแล้ว ผู้ตรวจสอบหัวหน้างานจะได้รับแจ้งเพื่อให้พวกเขาสามารถทำการเปลี่ยนแปลงคะแนนและความคิดเห็นก่อนที่จะเผยแพร่การประเมินผลงานสำหรับพนักงาน โปรดทราบว่าแบบฟอร์มจะได้รับการประมวลผลในเบื้องหลัง ขึ้นอยู่กับปริมาณการประเมินผลงานที่คุณเลือก คุณอาจยังเห็นแบบฟอร์มเหล่านี้บางส่วนเมื่อทำการเลือกในอนาคตขณะที่เราดำเนินการและส่งแบบฟอร์มเหล่านั้นกลับไปยังหัวหน้างาน คุณยังคงสามารถใช้แอปพลิเคชันและดำเนินการที่จำเป็นอื่นๆ ได้

source: {{count}} review was successfully moved to "Conversation & publication" stage.
th_th: การประเมินผลงาน {{count}} รายการได้ถูกย้ายไปยังขั้นตอน "การสนทนาและการเผยแพร่" สำเร็จแล้ว

source: {{count}} reviews were successfully moved to the "Conversation & publication" stage.x
th_th: การประเมินผลงาน {{count}} รายการถูกย้ายไปยังขั้นตอน "การสนทนาและการเผยแพร่" สำเร็จแล้ว

source: Move {{count}} review to the "Conversation & publication" stage. This action cannot be undone.
th_th: ย้ายการประเมินผลงาน {{count}} รายการไปที่ขั้นตอน "การสนทนาและการเผยแพร่" การดำเนินการนี้ไม่สามารถย้อนกลับได้

source: Move {{count}} reviews to the "Conversation & publication" stage. This action cannot be undone.
th_th: ย้ายการประเมินผลงาน {{count}} รายการไปที่ขั้นตอน "การสนทนาและการเผยแพร่" การดำเนินการนี้ไม่สามารถย้อนกลับได้

source: Review stage changed
th_th: เปลี่ยนขั้นตอนการตรวจสอบ

source: Current selection: {{count}}
th_th: รายการที่เลือกปัจจุบัน: {{count}}

source: Select reviews to continue
th_th: เลือกการประเมินเพื่อดำเนินการต่อ

source: To move reviews to a different stage, select the review stage and then filter to find specific reviews in the selected stage.
th_th: หากต้องการย้ายการประเมินผลงานไปยังขั้นตอนอื่น ให้เลือกขั้นตอนการประเมินผลงาน จากนั้นกรองเพื่อค้นหาการประเมินผลงานที่เจาะจงในขั้นตอนที่เลือก

source: Select a stage to continue
th_th: เลือกขั้นตอนเพื่อดำเนินการต่อ

source: Move stages
th_th: ย้ายขั้นตอน

source: Reviews in the selected stage: {{count}}
th_th: การประเมินในช่วงที่เลือก: {{count}}

source: {{count}} reviews were successfully moved.
th_th: ย้ายการประเมิน {{count}} รายการเรียบร้อยแล้ว

source: {{count}} review was successfully moved.
th_th: ย้ายรีวิว {{count}} รายการเรียบร้อยแล้ว

source: Move to "Conversation & publication" stage
th_th: ย้ายไปยังขั้นตอน “การสนทนาและการเผยแพร่”

source: Move to "Closed (system)" stage
th_th: ย้ายไปยังขั้นตอน "ปิด (ระบบ)"

source: Move to "Pending sign-off" stage
th_th: ย้ายไปยังขั้นตอน "รอการลงชื่อ"

source: Reopen (worker and manager)
th_th: เปิดอีกครั้ง (พนักงานและหัวหน้างาน)

source: You’re about to reassign the manager for this performance review. The new manager will gain all permissions and actions currently available to the existing manager.
th_th: คุณกำลังจะเปลี่ยนผู้จัดการสำหรับการประเมินผลการปฏิบัติงานครั้งนี้ ผู้จัดการคนใหม่จะได้รับสิทธิ์และการดำเนินการทั้งหมดที่ผู้จัดการคนปัจจุบันมีอยู่ในขณะนี้

source: Reviews in "{{stage}}" stage: {{count}}
th_th: การประเมินในขั้นตอน "{{stage}}": {{count}}

source: Exclude sensitive content
th_th: ไม่รวมเนื้อหาที่ละเอียดอ่อน

source: Search for sensitive content
th_th: ค้นหาเนื้อหาที่ละเอียดอ่อน

source: Show only sensitive content
th_th: แสดงเฉพาะเนื้อหาที่ละเอียดอ่อนเท่านั้น

source: Show all
th_th: แสดงทั้งหมด

source: Back to performance review templates
th_th: กลับไปยังแม่แบบการประเมินผลงาน

source: Delete selected
th_th: ลบรายการที่เลือก

source: Reviews that have passed the moderation stage cannot be deleted.
th_th: การประเมินผลงานที่ผ่านขั้นตอนการกลั่นกรองแล้วไม่สามารถลบได้

source: Current stage
th_th: ขั้นตอนปัจจุบัน

source: Global ID
th_th: รหัสประจำตัวทั่วโลก

source: Review content
th_th: ตรวจสอบเนื้อหา

source: Manager view
th_th: มุมมองหัวหน้างาน

source: Move to a different stage
th_th: ย้ายไปยังขั้นตอนอื่น

source: New review stage
th_th: ขั้นตอนการประเมินใหม่

source: Search results: {{count}}
th_th: ผลการค้นหา: {{count}}

source: Review stage: {{stage}}
th_th: ขั้นตอนการประเมินผลงาน: {{stage}}

source: View review
th_th: ดูการประเมินผลงาน

source: This review doesn't exist or is no longer available to you.
th_th: การประเมินผลงานนี้ไม่มีอยู่หรือไม่สามารถเข้าถึงได้อีกต่อไป

source: Indicate frequency
th_th: ระบุความถี่

source: Only reopen the form if you want the worker to also edit and resubmit their review. Otherwise, you can edit your comments and rating directly below.
th_th: เปิดแบบฟอร์มใหม่อีกครั้งเฉพาะในกรณีที่คุณต้องการให้พนักงานแก้ไขและส่งการประเมินผลงานอีกครั้งเท่านั้น หรืออีกทางหนึ่ง คุณสามารถแก้ไขความคิดเห็นและการให้คะแนนของคุณได้โดยตรงด้านล่าง

source: If you reopen this review, {{employee}} will be notified and will be able to edit their review.
th_th: หากคุณเปิดการประเมินผลงานนี้อีกครั้ง {{employee}} จะได้รับการแจ้งเตือนและจะสามารถแก้ไขการประเมินผลงานของตนได้

source: If you reopen this review, {{employee}} will be notified.
th_th: หากคุณเปิดการประเมินนี้อีกครั้ง {{employee}} จะได้รับการแจ้งเตือน

source: Requested to {{count}} workers:
th_th: ส่งคำขอไปยังพนักงาน {{count}} คน:

source: Requested to 1 worker:
th_th: ส่งคำขอไปยังพนักงาน 1 คน:

source: {{count}} people have answered this request
th_th: {{count}} คนได้ตอบคำขอนี้

source: {{count}} person has answered this request
th_th: {{count}} คนได้ตอบคำขอนี้

source: {{count}} people have not answered this request
th_th: {{count}} คนไม่ได้ตอบคำขอนี้

source: {{count}} person has not answered this request
th_th: {{count}} คนไม่ได้ตอบคำขอนี้

source: Add all goal types
th_th: เพิ่มประเภทเป้าหมายทั้งหมด

source: If you publish this review now, {{employee}} will not be able to submit their self-review and you will not be able to edit your review later. Once published, {{employee}} will see the outcome of the review.
th_th: หากคุณเผยแพร่การประเมินผลงานนี้ในตอนนี้ {{employee}} จะไม่สามารถส่งการประเมินผลงานของตนเองได้ และคุณจะไม่สามารถแก้ไขการประเมินผลงานในภายหลังได้ เมื่อเผยแพร่แล้ว {{employee}} จะเห็นผลลัพธ์ของการประเมินผลงานได้

source: I understand. I want to publish this review now.
th_th: ฉันเข้าใจแล้ว ฉันอยากจะเผยแพร่การประเมินผลงานนี้ทันที

source: OK. I will wait for the self-review to be submitted, and I will publish this review later.
th_th: โอเค ฉันจะรอส่งผลการประเมินตนเอง แล้วฉันจะเผยแพร่การประเมินผลงานนี้ในภายหลัง

source: Peers
th_th: เพื่อนร่วมงาน

source: Self
th_th: ตัวเอง

source: 360 review
th_th: การประเมินผลงานแบบ 360 องศา

source: Your review was submitted and will now be visible to the manager reviewer. Once published by the manager, the self-reviewer will also be able to see your input.
th_th: การประเมินผลงานของคุณถูกส่งไปแล้ว และตอนนี้จะปรากฏให้ผู้ตรวจสอบของหัวหน้างานเห็น เมื่อหัวหน้างานเผยแพร่ผลการประเมินผลงานแล้ว ผู้ตรวจสอบเองก็จะสามารถเห็นความคิดเห็นของคุณได้เช่นกัน

source: The new manager was successfully assigned to the review.
th_th: หัวหน้างานคนใหม่ได้รับมอบหมายให้ตรวจสอบเรียบร้อยแล้ว

source: The manager was successfully removed from the review.
th_th: ผู้จัดการถูกลบออกจากการตรวจสอบเรียบร้อยแล้ว

source: Additional managers
th_th: หัวหน้างานเพิ่มเติม

source: After applying, all remaining requests to add managers by the worker will be dismissed.
th_th: หลังจากยื่นเรื่องแล้ว คำขอเพิ่มหัวหน้างานที่เหลือทั้งหมดโดยพนักงานจะถูกยกเลิก

source: Remember that the focus of your performance review should be the changes you can make to be more impactful in the future. It’s good to reflect on the past, but don't forget to translate it into an action looking forward.
th_th: อย่าลืมว่าจุดเน้นในการประเมินผลการปฏิบัติงานของคุณควรอยู่ที่การเปลี่ยนแปลงที่คุณทำได้เพื่อให้เกิดผลกระทบมากขึ้นในอนาคต การทบทวนอดีตเป็นเรื่องที่ดี แต่ก็อย่าลืมแปลงอดีตเป็นการกระทำเพื่อมองไปข้างหน้าด้วย

source: Here are some tips to make the most out of your performance conversation.
th_th: ต่อไปนี้คือเคล็ดลับบางประการที่จะช่วยให้คุณได้รับประโยชน์สูงสุดจากการสนทนาเกี่ยวกับประสิทธิภาพของคุณ

source: Performance reviews can be daunting; make sure to address any concerns you have with your manager before the review so that you can have a productive conversation together.
th_th: การประเมินผลงานอาจเป็นเรื่องที่น่ากังวลได้ ดังนั้น คุณควรพิจารณาแจ้งข้อกังวลใดๆ ที่คุณมีกับหัวหน้างานก่อนการประเมินผลงาน เพื่อให้คุณสามารถพูดคุยอย่างสร้างสรรค์ได้

source: Gather your performance data, including feedback from colleagues, progress on your goals, survey reports, and any other relevant data. It is important to analyze your performance data so that you're ready and prepared for your performance review.
th_th: รวบรวมข้อมูลประสิทธิภาพการทำงานของคุณ รวมถึงฟีดแบคจากเพื่อนร่วมงาน ความคืบหน้าของเป้าหมาย รายงานการสำรวจ และข้อมูลที่เกี่ยวข้องอื่นๆ การวิเคราะห์ข้อมูลประสิทธิภาพการทำงานของคุณถือเป็นสิ่งสำคัญ เพื่อให้คุณพร้อมสำหรับการประเมินผลการทำงาน

source: Have a great review conversation!
th_th: มีการพูดคุยเกี่ยวกับการประเมินผลงานที่ยอดเยี่ยม!

source: Ahead of your performance review, take the time to look back on your progress and your achievements. This is the time to voice how you want to progress in your role and to plan a roadmap with your manager.
th_th: ก่อนที่จะประเมินผลการปฏิบัติงาน ให้ใช้เวลาทบทวนความก้าวหน้าและความสำเร็จของคุณ นี่คือเวลาที่จะบอกว่าคุณต้องการก้าวหน้าในบทบาทหน้าที่อย่างไร และวางแผนร่วมกับหัวหน้างานของคุณ

source: Attachment:
th_th: สิ่งที่แนบมา:

source: Why not request feedback on your behaviors now?
th_th: ทำไมไม่ขอฟีดแบคเกี่ยวกับพฤติกรรมของคุณตอนนี้ล่ะ

source: Hide behavior details
th_th: ซ่อนรายละเอียดพฤติกรรม

source: For your conversation, reflect on {{name}}'s behavior profile and think about occurrences when they have demonstrated each behavior, and what you think they should focus on in the future.
th_th: สำหรับการสนทนาของคุณ โปรดพิจารณาโปรไฟล์พฤติกรรมของ{{name}} และนึกถึงเหตุการณ์ที่พวกเขาได้แสดงพฤติกรรมแต่ละข้อ รวมถึงสิ่งที่คุณคิดว่าพวกเขาควรให้ความสำคัญในอนาคต

source: For your conversation, reflect on your behavior profile and think about occurrences when you demonstrated each behavior, or how you can focus on them in the future. Reflect on any feedback or insights you have received from your colleagues and whether you can use these to highlight any examples you have. Notice any gaps in your wheel? Request feedback now from your peers and stakeholders on any key behaviors.
th_th: สำหรับการสนทนาของคุณ ให้ไตร่ตรองถึงโปรไฟล์พฤติกรรมของคุณและนึกถึงเหตุการณ์ที่คุณแสดงพฤติกรรมแต่ละอย่าง หรือวิธีที่คุณสามารถมุ่งเน้นไปที่พฤติกรรมเหล่านั้นในอนาคต ไตร่ตรองถึงฟีดแบคหรือข้อมูลเชิงลึกที่คุณได้รับจากเพื่อนร่วมงาน และพิจารณาว่าคุณสามารถใช้สิ่งเหล่านี้เพื่อเน้นตัวอย่างที่คุณมีได้หรือไม่ สังเกตเห็นช่องว่างใดๆ ในวงล้อของคุณหรือไม่ ขอฟีดแบคจากเพื่อนร่วมงานและผู้มีส่วนได้ส่วนเสียเกี่ยวกับพฤติกรรมสำคัญใดๆ ทันที

source: Show behavior details
th_th: แสดงรายละเอียดพฤติกรรม

source: {{name}} has not received any behaviors over this review period.
th_th: {{name}} ไม่ได้รับพฤติกรรมใดๆ ในช่วงเวลาการประเมินผลงานนี้

source: You have not received any behaviors over this review period.
th_th: คุณไม่ได้รับพฤติกรรมใดๆ ในช่วงระยะเวลาการประเมินผลงานนี้

source: {{name}}'s behavior profile
th_th: โปรไฟล์พฤติกรรมของ {{name}}

source: This was not resolved. I want to formally challenge my review.
th_th: เรื่องนี้ไม่ได้รับการแก้ไข ฉันต้องการคัดค้านผลการประเมินผลงานของฉันอย่างเป็นทางการ

source: Discussion requested
th_th: ขอหารือ

source: Challenged
th_th: คัดค้านแล้ว

source: Change scale
th_th: เปลี่ยนมาตรวัด

source: Comments added by:
th_th: เพิ่มความคิดเห็นโดย:

source: Share your final thoughts
th_th: แบ่งปันความคิดสุดท้ายของคุณ

source: Complete moderation
th_th: การกลั่นกรองที่สมบูรณ์

source: Go to the review list
th_th: ไปที่รายการประเมินผลงาน

source: Stay on this review
th_th: ติดตามการประเมินผลงานนี้

source: Please check the status of the review timeline at the top of the review form to see the next step in the process for {{employee}}.
th_th: โปรดตรวจสอบสถานะไทม์ไลน์การประเมินผลงานที่ด้านบนของแบบฟอร์มการประเมินผลงานเพื่อดูขั้นตอนถัดไปในกระบวนการสำหรับ {{employee}}

source: You have completed the moderation stage.
th_th: คุณได้ดำเนินการขั้นตอนการกลั่นกรองเสร็จสิ้นแล้ว

source: I confirm that I have received feedback during the review challenge process.
th_th: ฉันยืนยันว่าฉันได้รับฟีดแบคในระหว่างกระบวนการคัดค้านการประเมินผลงาน

source: Confirmation
th_th: การยืนยัน

source: Performance conversation confirmation
th_th: การยืนยันการสนทนาเกี่ยวกับประสิทธิภาพ

source: Create custom widget
th_th: สร้างวิดเจ็ตที่กำหนดเอง

source: Edit widget
th_th: แก้ไขวิดเจ็ต

source: No custom widgets yet
th_th: ยังไม่มีวิดเจ็ตที่กำหนดเอง

source: Editable after result publication
th_th: แก้ไขได้หลังจากการเผยแพร่ผลลัพธ์

source: Are you sure you want to exit? Your changes will not be saved.
th_th: คุณแน่ใจหรือไม่ว่าต้องการออก การเปลี่ยนแปลงของคุณจะไม่ได้รับการบันทึก

source: Create widget
th_th: สร้างวิดเจ็ต

source: Enter a question
th_th: ป้อนคำถาม

source: Widget title
th_th: ชื่อวิดเจ็ต

source: Enter a title
th_th: ป้อนชื่อเรื่อง

source: Widget visible to managers and workers
th_th: วิดเจ็ตที่หัวหน้างานและพนักงานสามารถมองเห็นได้

source: Widget visible only to managers
th_th: วิดเจ็ตจะมองเห็นได้เฉพาะหัวหน้างานเท่านั้น

source: Widget placement
th_th: การจัดวางวิดเจ็ต

source: Above the overall performance
th_th: เหนือกว่าประสิทธิภาพโดยรวม

source: End of the form
th_th: สิ้นสุดแบบฟอร์ม

source: Top of the form
th_th: ด้านบนของแบบฟอร์ม

source: Response visibility
th_th: การมองเห็นการตอบกลับ

source: Reassign my manager review
th_th: มอบหมายการประเมินผลงาน

source: Manager — Reassigned by {{name}}
th_th: หัวหน้างาน — มอบหมายใหม่โดย {{name}}

source: Reassigned manager review to:
th_th: มอบหมายการประเมินผลงานของหัวหน้างานใหม่ให้:

source: Reassigned to you by:
th_th: มอบหมายให้กับคุณโดย:

source: I want to discuss further
th_th: ฉันอยากจะพูดคุยต่อ

source: Do you want to respond or highlight any changes to the worker?
th_th: คุณต้องการที่จะตอบกลับหรือเน้นการเปลี่ยนแปลงใด ๆ ให้กับพนักงานหรือไม่

source: You have indicated that you would like to have a conversation about your review; therefore, your manager will be able to amend their ratings and comments. Once they republish the review, you will be able to accept or challenge their final submission.
th_th: คุณได้แจ้งว่าต้องการพูดคุยเกี่ยวกับการประเมินผลงานของคุณ ดังนั้น หัวหน้างานของคุณจะสามารถแก้ไขคะแนนและความคิดเห็นของพวกเขาได้ เมื่อหัวหน้างานเผยแพร่การประเมินผลงานอีกครั้ง คุณจะสามารถยอมรับหรือโต้แย้งการส่งครั้งสุดท้ายของพวกเขาได้

source: Edit performance review
th_th: แก้ไขการประเมินผลการปฏิบัติงาน

source: If you submit your self-review now, you will not be able to edit it later.
th_th: หากคุณส่งผลการประเมินตนเองของตัวเองตอนนี้ คุณจะไม่สามารถแก้ไขได้ในภายหลัง

source: If you submit now, {{employee}} will not be able to submit their self-review.
th_th: หากคุณส่งตอนนี้ {{employee}} จะไม่สามารถส่งผลการประเมินตนเองของพวกเขาได้

source: I understand. I want to submit my self-review now.
th_th: ฉันเข้าใจแล้ว ฉันอยากส่งผลการประเมินตนเองของตัวเองแล้ว

source: Your self-review was submitted to your manager.
th_th: ผลการประเมินตนเองของคุณได้ถูกส่งให้กับหัวหน้างานของคุณแล้ว

source: I understand. I want to submit my review now and start the performance conversation.
th_th: ฉันเข้าใจแล้ว ฉันต้องการส่งผลการประเมินตนเองของฉันและเริ่มการสนทนาเกี่ยวกับประสิทธิภาพการทำงานทันที

source: I need to continue making changes. I will submit my review later.
th_th: ฉันยังต้องทำการเปลี่ยนแปลงต่อไป ฉันจะส่งผลการประเมินตนเองในภายหลัง

source: I need to continue making changes. I will submit my self-review later.
th_th: ฉันยังต้องปรับปรุงแก้ไขต่อไป ฉันจะส่งผลการประเมินตนเองในภายหลัง

source: No description, measurement criteria or key deliverables to display.
th_th: ไม่มีคำอธิบาย เกณฑ์การวัด หรือข้อมูลส่งมอบที่สำคัญที่จะแสดง

source: If you submit your review now, you will not be able to edit it later.
th_th: หากคุณส่งการประเมินผลงานของคุณตอนนี้ คุณจะไม่สามารถแก้ไขได้ในภายหลัง

source: If you submit now, {{reviewers}} will not be able to submit their reviews.
th_th: หากคุณส่งตอนนี้ {{reviewers}} จะไม่สามารถส่งการประเมินผลงานของพวกเขาได้

source: I understand. I want to submit my manager review now.
th_th: ฉันเข้าใจแล้ว ฉันต้องการส่งการประเมินผลงานของหัวหน้างานของฉันให้ทราบทันที

source: OK. I will wait for the other reviews to be submitted.
th_th: โอเค ฉันจะรอจนกว่าการประเมินผลงานอื่นๆ จะถูกส่งมา

source: The additional manager review is optional. No review was provided yet.
th_th: การประเมินผลงานของหัวหน้างานเพิ่มเติมเป็นทางเลือก ยังไม่มีการประเมินผลงานใดๆ

source: I understand. I want to submit my review now.
th_th: ฉันเข้าใจแล้ว ฉันต้องการส่งการประเมินผลงานของฉันทันที

source: {{name}} has not received any feedback that is visible to you over this review period.
th_th: {{name}} ไม่ได้รับฟีดแบคใดๆ ที่ปรากฏแก่คุณในช่วงเวลาการประเมินผลงานนี้

source: Why not review your feedback now?
th_th: ทำไมไม่ลองตรวจสอบฟีดแบคของคุณตอนนี้ล่ะ

source: You have not received any feedback that is visible to {{name}} over this review period.
th_th: คุณไม่ได้รับฟีดแบคใดๆ ที่สามารถมองเห็นได้โดย {{name}} ในช่วงระยะเวลาการประเมินผลงานนี้

source: Change overall performance comment
th_th: เปลี่ยนความคิดเห็นโดยรวมเกี่ยวกับผลงาน

source: Change overall performance rating
th_th: เปลี่ยนคะแนนประเมินผลการปฏิบัติงานโดยรวม

source: Clicking the button will confirm your agreement with the performance review data.
th_th: การคลิกปุ่มจะยืนยันการตกลงของคุณกับข้อมูลการประเมินผลงาน

source: This performance review was validated by a higher-level manager.
th_th: การประเมินผลการปฏิบัติงานครั้งนี้ได้รับการรับรองโดยหัวหน้างานระดับสูงกว่า

source: The review was successfully validated.
th_th: การประเมินผลงานได้รับการตรวจสอบความถูกต้องเรียบร้อยแล้ว

source: This snapshot reflects the status of the behaviors as of {{date}}
th_th: สแนปชอตนี้แสดงสถานะของพฤติกรรม ณ วันที่ {{date}}

source: Close details
th_th: ปิดรายละเอียด

source: Tags:
th_th: แท็ก:

source: View details
th_th: ดูรายละเอียด

source: Goals and feedback were shared with the reassigned manager to enable completion of the review.
th_th: มีการแบ่งปันเป้าหมายและฟีดแบคกับหัวหน้างานที่ได้รับมอบหมายใหม่เพื่อให้สามารถดำเนินการประเมินผลงานให้เสร็จสมบูรณ์ได้

source: Goals at a glance
th_th: เป้าหมายโดยสรุป

source: Review uploaded by HR on {{date}}
th_th: อัปโหลดการประเมินผลงานโดย HR เมื่อวันที่ {{date}}

source: Not submitted
th_th: ยังไม่ได้ส่ง

source: Access reviews, monitor progress, and keep up with the process.
th_th: เข้าถึงการประเมิน ติดตามความคืบหน้า และดำเนินการให้เป็นไปตามกระบวนการ

source: This was resolved. I’m happy with the outcome.
th_th: ปัญหานี้ได้รับการแก้ไขแล้ว ฉันพอใจกับผลลัพธ์

source: Go to this goal page
th_th: ไปที่หน้าเป้าหมายนี้

source: Show closed reviews
th_th: แสดงการประเมินผลงานที่ปิด
